[
    {
        "id": 1,
        "image": "img/airpod.png",
        "name": "Airpod",
        "main_feature": "White",
        "rating": 4.5,
        "likes": "91%",
        "reviews": 25,
        "description": "Experience unlimited musical freedom with AirPods! Instant connectivity, crystal-clear sound, and elegant design. Live the wireless experience that redefines the way you listen to music. AirPods: the effortless audio revolution.",
        "details": [
            {
                "feature": "Connectivity",
                "details": "Bluetooth 5.0 for fast and stable connection"
            },
            {
                "feature": "Sound Quality",
                "details": "Clear and immersive audio with noise-canceling technology"
            },
            {
                "feature": "Design",
                "details": "Ergonomic and discreet, fits perfectly in the ear"
            },
            {
                "feature": "Battery",
                "details": "Up to 5 hours of continuous playback, with charging case"
            },
            {
                "feature": "Controls",
                "details": "Intuitive touch for play, pause, and call handling"
            },
            {
                "feature": "Compatibility",
                "details": "Compatible with iOS, Android, and other Bluetooth devices"
            },
            {
                "feature": "Sensors",
                "details": "Built-in sensors for automatic pause when removed from ears"
            },
            {
                "feature": "Resistance",
                "details": "Splash and sweat resistant, ideal for workouts"
            }
        ],
        "price": 239.99,
        "promotional_price": 229.99
    },
    {
        "id": 2,
        "image": "img/iphone.png",
        "name": "iPhone 15 Pro Max",
        "main_feature": "2 TB",
        "rating": 3.8,
        "likes": "94%",
        "reviews": 15,
        "description": "Explore the future of technology with the iPhone 15 Pro Max. Exceptional performance, revolutionary cameras, and an impressive display. Experience innovation in your hands with elegant design and advanced features. iPhone 15 Pro Max - the ultimate evolution of mobile experience.",
        "details": [
            {
                "feature": "Performance",
                "details": "Powerful A16 processor for smooth app and game execution"
            },
            {
                "feature": "Cameras",
                "details": "Triple camera system with advanced technology for stunning captures in any environment"
            },
            {
                "feature": "Display",
                "details": "6.7-inch Super Retina XDR display with sharp resolution and vibrant colors"
            },
            {
                "feature": "Design",
                "details": "Elegant body made of premium materials, combining style and durability"
            },
            {
                "feature": "Storage",
                "details": "Generous internal storage options for your photos, videos, and apps"
            },
            {
                "feature": "Battery",
                "details": "Long-lasting battery to keep up with your daily routine"
            },
            {
                "feature": "Operating System",
                "details": "Seamless integration with iOS, offering the latest version of the OS"
            },
            {
                "feature": "Connectivity",
                "details": "Advanced features including 5G for ultra-fast connection"
            },
            {
                "feature": "Security",
                "details": "Advanced security features including facial recognition and biometric authentication"
            }
        ],
        "price": 15599.99,
        "promotional_price": 14999.99
    },
    {
        "id": 3,
        "image": "img/xbox.png",
        "name": "Xbox Series X",
        "main_feature": "1 TB",
        "rating": 4.5,
        "likes": "96%",
        "reviews": 25,
        "description": "Discover the pinnacle of gaming entertainment with Xbox Series X. Enjoy unmatched performance, next-gen graphics, and an immersive experience like never before. Xbox Series X - the future of gaming is in your hands.",
        "details": [
            {
                "feature": "Performance",
                "details": "Custom processor delivering smooth gameplay and impressive graphics"
            },
            {
                "feature": "Graphics",
                "details": "True 4K playback capability, providing incredibly detailed visuals"
            },
            {
                "feature": "Storage",
                "details": "Ultra-fast SSD for instant game loading and lag-free experience"
            },
            {
                "feature": "Design",
                "details": "Bold and compact design, complementing any gaming setup"
            },
            {
                "feature": "Controller",
                "details": "Advanced wireless controller with Bluetooth and adaptive triggers"
            },
            {
                "feature": "Game Library",
                "details": "Access to a wide variety of games, including Xbox Game Studios exclusives"
            },
            {
                "feature": "Compatibility",
                "details": "Backward compatibility with Xbox One, Xbox 360, and original Xbox games"
            },
            {
                "feature": "Connectivity",
                "details": "Stable online connectivity for uninterrupted multiplayer experience"
            },
            {
                "feature": "Resolution",
                "details": "Supports up to 120 frames per second for ultra-smooth gameplay"
            }
        ],
        "price": 3999.99,
        "promotional_price": 3799.99
    },
    {
        "id": 4,
        "image": "img/macbook.png",
        "name": "MacBook Pro 2023",
        "main_feature": "512 GB 16GB RAM",
        "rating": 4.8,
        "likes": "89%",
        "reviews": 30,
        "description": "Take your productivity to the next level with MacBook Pro 2023. Exceptional performance, elegant design, and the reliability you expect from Apple. MacBook Pro 2023 - the ultimate choice for creative professionals and demanding users.",
        "details": [
            {
                "feature": "Performance",
                "details": "Custom M2 processor for superior speed and efficiency"
            },
            {
                "feature": "Display",
                "details": "14-inch Retina display with vibrant colors and stunning resolution"
            },
            {
                "feature": "Storage",
                "details": "High-capacity SSD for fast file storage and access"
            },
            {
                "feature": "Design",
                "details": "Elegant and ultra-thin aluminum body, combining style and portability"
            },
            {
                "feature": "Keyboard",
                "details": "Backlit Magic Keyboard for comfortable typing in any environment"
            },
            {
                "feature": "Battery",
                "details": "Long-lasting battery to power through your workday without interruptions"
            },
            {
                "feature": "Operating System",
                "details": "Seamless integration with macOS, offering a smooth and intuitive experience"
            },
            {
                "feature": "Connectivity",
                "details": "Thunderbolt ports for ultra-fast data transfers and versatile connectivity"
            },
            {
                "feature": "Security",
                "details": "Advanced features including Touch ID for secure unlocking and payments"
            }
        ],
        "price": 8999.99,
        "promotional_price": 8699.99
    }
]